---
kind: enumMember
id: F:Autodesk.Revit.DB.Fabrication.ValidationStatus.InvalidDimensions
enum: Autodesk.Revit.DB.Fabrication.ValidationStatus
source: html/bf3700c3-dd66-1655-a0cd-e610c1aff5f2.htm
---
# Autodesk.Revit.DB.Fabrication.ValidationStatus.InvalidDimensions

The part has invalid dimensions.